SoCXin/CH32V203/IAP/M0/REG/BOOT/Bootloader_UART/APP/inc/config.h
/******************************************************************************
 * @file    config.h
 * @author  MM32 AE
 * @version V1.00
 * @date    10-June-2020
 * @brief   ......
******************************************************************************/


/* Define to prevent recursive inclusion ------------------------------------*/
#ifndef __CONFIG_H__
#define __CONFIG_H__


#ifdef __cplusplus
extern "C" {
#endif


/* Includes -----------------------------------------------------------------*/
#include <stdio.h>
#include <stdint.h>
#include <stdlib.h>
#include <string.h>


/* Includes -----------------------------------------------------------------*/
#if defined (MM32F032_S)
#include "mm32_reg.h"
#elif (MM32L06XX_S)
#include "mm32_reg.h"
#elif (MM32SPIN06XX_S)
#include "mm32_reg.h"
#elif (MM32F031_Q)
#include "MM32F031x4x6_q.h"
#include "system_MM32F031x4x6_q.h"
#elif (MM32F003_Q)
#include "MM32F003_q.h"
#include "system_MM32F003_q.h"
#elif (MM32SPIN05_Q)
#include "MM32SPIN0x_q.h"
#include "system_MM32SPIN0x_q.h"
#elif (MM32SPIN27_P)
#include "MM32SPIN2xx_p.h"
#include "system_MM32SPIN2xx_p.h"
#elif (MM32F031_N)
#include "MM32F031xxn.h"

#elif (MM32L0XX_N)
#include "MM32L0xx.h"
#endif

/* Exported constants -------------------------------------------------------*/

/* Define device flash size */
#if defined (MM32F032_S)
#define FLASH_SIZE          (64)/* Flash capacity of the selected chip (in K)*/
#define USER_FLASH_LAST_PAGE_ADDRESS  0x0800FB00
#define USER_FLASH_END_ADDRESS        0x0800FFFF /* 64 KBytes */
#elif (MM32L06XX_S)
#define FLASH_SIZE          (64)/* Flash capacity of the selected chip (in K)*/
#define USER_FLASH_LAST_PAGE_ADDRESS  0x0800FB00
#define USER_FLASH_END_ADDRESS        0x0800FFFF /* 64 KBytes */
#elif (MM32SPIN06XX_S)
#define FLASH_SIZE          (64)/* Flash capacity of the selected chip (in K)*/
#define USER_FLASH_LAST_PAGE_ADDRESS  0x0800FB00
#define USER_FLASH_END_ADDRESS        0x0800FFFF /* 64 KBytes */
#elif (MM32F031_Q)
#define FLASH_SIZE          (32)/* Flash capacity of the selected chip (in K)*/
#define USER_FLASH_LAST_PAGE_ADDRESS  0x08007B00
#define USER_FLASH_END_ADDRESS        0x08007FFF /* 32 KBytes */
#elif (MM32F003_Q)
#define FLASH_SIZE          (16)/* Flash capacity of the selected chip (in K)*/
#define USER_FLASH_LAST_PAGE_ADDRESS  0x08003B00
#define USER_FLASH_END_ADDRESS        0x08003FFF /* 16 KBytes */
#elif (MM32SPIN05_Q)
#define FLASH_SIZE          (32)/* Flash capacity of the selected chip (in K)*/
#define USER_FLASH_LAST_PAGE_ADDRESS  0x08007B00
#define USER_FLASH_END_ADDRESS        0x08007FFF /* 32 KBytes */
#elif (MM32SPIN27_P)
#define FLASH_SIZE          (128)/* Flash capacity of the selected chip (in K)*/
#define USER_FLASH_LAST_PAGE_ADDRESS  0x0801FB00
#define USER_FLASH_END_ADDRESS        0x0801FFFF /* 128 KBytes */
#elif (MM32F031_N)
#define FLASH_SIZE          (128)/* Flash capacity of the selected chip (in K)*/
#define USER_FLASH_LAST_PAGE_ADDRESS  0x0801FB00
#define USER_FLASH_END_ADDRESS        0x0801FFFF /* 128 KBytes */
#elif (MM32L0XX_N)
#define FLASH_SIZE          (128)/* Flash capacity of the selected chip (in K)*/
#define USER_FLASH_LAST_PAGE_ADDRESS  0x0801FB00
#define USER_FLASH_END_ADDRESS        0x0801FFFF /* 128 KBytes */
#endif

/* Warning: Only one transfer protocol definition below can be selected! */

/*
//#define XMODEM_EN
//#define XMODEM1K_EN
//#define YMODEM_EN
//#define BINARY_EN
//#define ASCII_EN
*/

#define XMODEM_EN    /* transfer protocol define */

#if defined (XMODEM_EN) || defined (XMODEM1K_EN)
#include "xmodem.h"
#elif defined (YMODEM_EN)  || defined (YMODEM1K_EN)
#include "ymodem.h"
#elif defined (BINARY_EN)
#include "binary.h"
#elif defined (ASCII_EN)
#include "ascii.h"
#else

#endif

/* transfer Baud rate define , 9600 or 115200  */
#define IAP_BAUD                9600
#define APPLICATION_ADDRESS     (uint32_t)0x8001400
#define ASCII_HEX_ADDRESS       (uint32_t)0x8008000
/* The parameter arrangement is :
UpgradeReqFlag + AppExsitFlag + AppBinCheck + UpBaud + бнбн
Note: Each parameter takes only one byte!
*/
#define PARA_ADDRESS    (uint32_t)0x8001000
#define PARA_SIZE       (12)

#define CHECKAPP_EN     0   /* Default is 0, no check for the app data */
#define DEBUG_EN        0   /* Default is 0, no putout log */

/* Default is 0, Ex factory burning does not need to merge hex */
#define MERGE_HEX_EN    0

#ifdef  MM32F003_Q
#define IAP_UART  UART2   /* Used for IAP */
//#define PRINTF_EN
#ifdef PRINTF_EN
#define PRINTF_UART  UART2   /* Used for printf */
#endif
#else
#define IAP_UART  UART1   /* Used for IAP */
//#define PRINTF_EN
#ifdef PRINTF_EN
#define PRINTF_UART  UART1   /* Used for printf */
#endif
#endif


/* Exported macro -----------------------------------------------------------*/

#ifdef __cplusplus
}
#endif


#endif


/******************* (C) COPYRIGHT 2020 ***************************/

